tap "buo/cask-upgrade"
tap "domt4/autoupdate"
brew "aichat"
brew "bash"
brew "bash-completion"
brew "go"
brew "mas"
brew "nvm"
brew "oh-my-posh"
brew "pnpm"
brew "pyenv"
brew "rbenv"
brew "rustup"
brew "starship"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "alfred"
cask "android-studio"
cask "arc"
cask "beekeeper-studio"
cask "calibre"
cask "docker-desktop"
cask "fig"
cask "font-fira-code-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "github"
cask "google-chrome"
cask "handbrake-app"
cask "imageoptim"
cask "iterm2"
cask "itsycal"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "ngrok"
cask "postman"
cask "raycast"
cask "rectangle"
cask "termius"
cask "the-unarchiver"
cask "virtualbox"
cask "visual-studio-code"
cask "warp"
cask "whatsapp"
cask "zed"
mas "Bakery", id: 1575220747
mas "Codye", id: 1516894961
mas "Copilot", id: 6738511300
mas "Developer", id: 640199958
mas "Perplexity", id: 6714467650
mas "Prompt", id: 1594420480
mas "Swift Playground", id: 1496833156
mas "System Designer", id: 1102494854
mas "TestFlight", id: 899247664
mas "Urban VPN Desktop", id: 1517772049
mas "Xcode", id: 497799835
