tap "buo/cask-upgrade"
tap "domt4/autoupdate"
brew "aichat"
brew "readline"
brew "bash"
brew "bash-completion"
brew "bash-preexec"
brew "openssl@3"
brew "bat"
brew "go"
brew "mas"
brew "nvm"
brew "oh-my-posh"
brew "sqlite"
brew "xz"
brew "pipx"
brew "pnpm"
brew "pyenv"
brew "rbenv"
brew "rustup"
brew "starship"
brew "tcl-tk"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "alfred"
cask "android-studio"
cask "arc"
cask "beekeeper-studio"
cask "calibre"
cask "docker-desktop"
cask "font-fira-code-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "github"
cask "google-chrome"
cask "handbrake-app"
cask "imageoptim"
cask "iterm2"
cask "itsycal"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "ngrok"
cask "postman"
cask "raycast"
cask "rectangle"
cask "termius"
cask "the-unarchiver"
cask "virtualbox"
cask "visual-studio-code"
cask "warp"
cask "whatsapp"
cask "zed"
mas "Bakery", id: 1575220747
mas "Codye", id: 1516894961
mas "Copilot", id: 6738511300
mas "Developer", id: 640199958
mas "Perplexity", id: 6714467650
mas "Prompt", id: 1594420480
mas "Swift Playground", id: 1496833156
mas "System Designer", id: 1102494854
mas "TestFlight", id: 899247664
mas "Urban VPN Desktop", id: 1517772049
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "blanu.vscode-styled-jsx"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "imgildev.vscode-auto-barrel"
vscode "imgildev.vscode-json-flow"
vscode "imgildev.vscode-next-pack"
vscode "imgildev.vscode-nextjs-generator"
vscode "jmkrivocapich.drawfolderstructure"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "lucono.karma-test-explorer"
vscode "mariusalchimavicius.json-to-ts"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-speech"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "mushan.vscode-paste-image"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "pmneo.tsimporter"
vscode "pulkitgangwar.nextjs-snippets"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.polaris-for-vscode"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "shopify.theme-check-vscode"
vscode "shopify.vscode-shadowenv"
vscode "sorbet.sorbet-vscode-extension"
vscode "steoates.autoimport"
vscode "stringham.move-ts"
vscode "styled-components.vscode-styled-components"
vscode "usernamehw.errorlens"
vscode "vincaslt.highlight-matching-tag"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscodevim.vim"
vscode "willluke.nextjs"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
